app/views/businesses/new.html.erb

SELECT "categories".* FROM "categories"
---

  <% @cat_cat=Category.all[5928..5953] %>