app/views/businesses/show.html.erb

            Phone: <%= @business.phone %></br>
Category1: <%= Category.find(@business.category1_id).name %></br>
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

  <div class="col-md-8">
    <% if @business.experiences.any? %>
---
SELECT  1 AS one FROM "experiences" WHERE "experiences"."business_id" = ? LIMIT ?  [["business_id", 1041857], ["LIMIT", 1]]