app/views/users/show.html.erb

    <%= render 'follow_form' if logged_in? %>
      <% if @user.experiences.any? %>
---
SELECT  1 AS one FROM "experiences" WHERE "experiences"."user_id" = ? LIMIT ?  [["user_id", 4], ["LIMIT", 1]]