app/views/shared/_user_info.html.erb

<span><%= link_to "view my profile", current_user %></span>
<span><%= pluralize(current_user.experiences.count, "experience") %></span>
---
SELECT COUNT(*) FROM "experiences" WHERE "experiences"."user_id" = ?  [["user_id", 1]]