app/views/experiences/_experience.html.erb

    <div class="host">
    <%= link_to Business.find_by(id: experience.business_id).name, Business.find_by(id: experience.business_id) %>
---
SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]