app/controllers/businesses_controller.rb

  def index
    load_businesses
    @businesses = Business.paginate(page: params[:page])
---
SELECT  "businesses".* FROM "businesses" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "businesses"

  def create
    @business = Business.new(business_params)
    #if @business.save
     # flash[:success] = "Business saved!"
      #redirect_to @business
  #  else
   #   flash[:alert] = "Business not saved!"
    #  render 'new'
    #end
    respond_to do |format|
      if @business.save
---
INSERT INTO "businesses" ("name", "address1", "address2", "city", "state", "zipcode", "phone", "latitude", "longitude", "category1_id", "category2_id", "category3_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show

    load_businessz
    @businessz = Business.paginate(page: params[:page])
    #redirect_to root_url and return unless @user.activated?

    @experiences = Experience.where(business_id: @business)
---
SELECT "experiences".* FROM "experiences" WHERE "experiences"."business_id" = ? ORDER BY "experiences"."created_at" DESC  [["business_id", 1041857]]

  def followerzs
    @title = "Followerzs"
    @business = Business.find(params[:id])
---
SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def search
    @businesses = Business.search(params)
---
SELECT "businesses".* FROM "businesses" WHERE (name ilike '%mcdonald''s%' or city ilike '%mcdonald''s%' or state ilike '%mcdonald''s%') AND (businesses.latitude IS NOT NULL AND businesses.longitude IS NOT NULL) AND (businesses.latitude>40.62035045885856 AND businesses.latitude<40.736006341141426 AND businesses.longitude>-74.02040954882901 AND businesses.longitude<-73.867906251171) AND ((

  def load_businesses
   @businesses_default = Gmaps4rails.build_markers(Business.paginate(page: params[:page])) do |plot, marker|
---
SELECT  "businesses".* FROM "businesses" WHERE ((LOWER(city) LIKE '%brooklyn%' OR LOWER(state) LIKE '%brooklyn%' OR LOWER(city) LIKE '%ny%' OR LOWER(state) LIKE '%ny%')) AND ((LOWER(name) LIKE '%chinese%')) LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "businesses"

  def set_business
      @business = Business.find(params[:id])
---
SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = ? LIMIT ?  [["id", 1041857], ["LIMIT", 1]]