app/controllers/experiences_controller.rb

INSERT INTO "experiences" ("comment", "business_id", "user_id", "created_at", "updated_at", "picture") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "test"], ["business_id", 1], ["user_id", 1], ["created_at", "2018-12-09 12:49:27.987173"], ["updated_at", "2018-12-09 12:49:27.987173"], ["picture", "About4KTV.png"]]
---
  def create

    @experience = current_user.experiences.build(experience_params)

    @experience.business = @business
    #@host = Business.find_by(@experience.business_id)
    #@experience.save

    if @experience.save

SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_business
    @business = Business.find(params[:business_id])