app/controllers/relationshipzs_controller.rb

SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def create
    @business = Business.find(params[:followedz_id])

SELECT  "relationshipzs".* FROM "relationshipzs" WHERE "relationshipzs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    @business = Relationshipz.find(params[:id]).followedz