app/controllers/static_pages_controller.rb

  def home
    if logged_in?
    @experience = current_user.experiences.build if logged_in?
    @review = current_user.reviews.build
    @feed_items = current_user.feed.paginate(page: params[:page])
---
SELECT  "experiences".* FROM "experiences" WHERE (business_id IN (SELECT followedz_id FROM relationshipzs
SELECT COUNT(*) FROM "experiences" WHERE (business_id IN (SELECT followedz_id FROM relationshipzs

  def demo_login
    @user = User.find_by(id: 6)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def user_feed
    if logged_in?
    @experience = current_user.experiences.build
    @review = current_user.reviews.build
    @feed_items = current_user.feed.paginate(page: params[:page])
---
SELECT  "experiences".* FROM "experiences" WHERE (user_id IN (SELECT followed_id FROM relationships
SELECT COUNT(*) FROM "experiences" WHERE (user_id IN (SELECT followed_id FROM relationships