app/controllers/users_controller.rb

SELECT COUNT(*) FROM "users" WHERE "users"."activated" = ?  [["activated", "t"]]
---
  def index
    @users = User.where(activated: true).paginate(page: params[:page])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "experiences".* FROM "experiences" WHERE "experiences"."user_id" = ? ORDER BY "experiences"."created_at" DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "experiences" WHERE "experiences"."user_id" = ?  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @reviews = @user.reviews.paginate(page: params[:page])
    @experiences = @user.experiences.paginate(page: params[:page])

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def following
    @title = "Following"
    @user  = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def followers
    @title = "Followers"
    @user  = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE (name ilike '%mr.g%') LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
---
  def search
    @users = User.search(params).paginate(:page => params[:page], :per_page => 30)